the apply worked without issues (was quick too),

```
$ terraform apply
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:cluster/atlantis]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-094742232bd5e527a]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c0063719053916fd]
aws_iam_role.ecs_task_execution: Refreshing state... [id=atlantis-ecs_task_execution]
aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06d9174ee2483e072]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e922a5002add8853]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0acf5973d9f72f49e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04f3954fdcdc464cc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00b71fec50b5c1ac1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fbcf07c85bd5e9b0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030fa5c5a3cdc9b58]
module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09c720ad0136715c1]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0ac45ed33679c137b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e922a5002add88531080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04cfcee305e537484]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04dfd242c0959d5d8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ffd1a85322b1971c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f95696df900098e8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05287abddd74bcee6]
module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1052403968]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3227126067]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1222689245]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4133695268]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3102628661]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2340891955]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030fa5c5a3cdc9b581080289494]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:loadbalancer/app/atlantis/4a255769da024305]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/eaf0519f7d8751df]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:listener/app/atlantis/4a255769da024305/c5cad1a686632932]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.atlantis will be created
  + resource "aws_ecs_service" "atlantis" {
      + cluster                            = "arn:aws:ecs:us-east-1:804464997158:cluster/atlantis"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "atlantis"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "atlantis"
        }
      + task_definition                    = "atlantis:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "atlantis"
          + container_port   = 4141
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/eaf0519f7d8751df"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-06d9174ee2483e072",
              + "subnet-0acf5973d9f72f49e",
            ]
        }
    }

  # module.atlantis_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group with open port for Atlantis (4141) from ALB, egress ports are all world open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "atlantis-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "atlantis"
        }
      + vpc_id                 = "vpc-094742232bd5e527a"
    }

  # module.atlantis_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Atlantis"
      + from_port                = 4141
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0ac45ed33679c137b"
      + to_port                  = 4141
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.atlantis_sg.aws_security_group.this_name_prefix[0]: Creating...
module.atlantis_sg.aws_security_group.this_name_prefix[0]: Creation complete after 2s [id=sg-0c83e7e3cc9716ad4]
module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Creating...
aws_ecs_service.atlantis: Creating...
module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Creating...
module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Creation complete after 0s [id=sgrule-2055104306]
aws_ecs_service.atlantis: Creation complete after 0s [id=arn:aws:ecs:us-east-1:804464997158:service/atlantis/atlantis]
module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Creation complete after 1s [id=sgrule-690486483]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```